In [63]:
import pandas as pd

In [64]:
rentas= pd.read_csv('rentas.csv')
rentas_2= pd.read_csv('rentas_2.csv')

#Concatenamos los datos:

In [65]:
df = pd.concat([rentas, rentas_2], axis=0)

#Rainiciamos el indez de nuestra columna: #No unir descripcion.
df.reset_index(drop = True, inplace = True)

### #Emepzamos a limpiar los datos:

In [66]:
df.head(1)

,info,m2_a_l_estac,descripcion,direccion
0,"MN 92,000\nFraccionamiento Costa Azul, Acapulc...",460 m²\n460 m²\n20 estac.,"Edificio en renta, 4 niveles disponibles. Fren...","En Renta Edificio, Pisos Completos Frente a Wa..."

### #Empezamos hacer la limpieza de datos(Data cleaning)

In [67]:
#Empezamos la limpieza de la columna " m2_a_l_estac ":
m2_df = df['m2_a_l_estac'].str.split("\n", expand=True)
m2_df.head(1)

        0       1          2     3
0  460 m²  460 m²  20 estac.  None

In [68]:
#Empezamos la limpieza de info:
df_t = df['info'].str.split("\n", n=1,expand=True)
df_t.head(1)

           0                                               1
0  MN 92,000  Fraccionamiento Costa Azul, Acapulco de Juárez

In [69]:
#Empezamos a modificar los datos de precio:
precio = df_t[0].str.split('MN',n=1,  expand=True)
precio_1 = precio[0].iloc[11:].str.split('$', n=1, expand=True)
precio_1 = precio_1[1].str.split('MXN', n=1, expand=True)
precio_1 = precio_1.drop(columns = [1])

#Ahora vamos a guardar las filas de 0 a 10 con iloc
precio_2 = precio[1].iloc[0:11]

In [70]:
#concatenamos las dos columnas:
precio = pd.concat([precio_2, precio_1]) 
precio

           0
0     92,000
1      3,200
2     54,437
3     54,466
4      3,200
5     54,437
6     25,000
7     82,816
8      3,000
9     82,816
10     7,500
11   25,000
12   16,550
13   25,000
14   13,000
15   49,500
16   14,000
17    7,200
18   54,437
19   54,466
20  103,500
21   54,466
22   43,000
23  250,000
24   10,208
25   10,000
26    7,000
27  120,000
28    5,000
29   11,500
30   13,000
31   58,400
32    7,500
33    8,500
34   15,000

In [71]:
#Empezamos transformando las comas por el punto:
price = precio[0].str.replace(",", ".")

In [76]:
price

0       92.000
1        3.200
2       54.437
3       54.466
4        3.200
5       54.437
6       25.000
7       82.816
8        3.000
9       82.816
10       7.500
11     25.000
12     16.550
13     25.000
14     13.000
15     49.500
16     14.000
17      7.200
18     54.437
19     54.466
20    103.500
21     54.466
22     43.000
23    250.000
24     10.208
25     10.000
26      7.000
27    120.000
28      5.000
29     11.500
30     13.000
31     58.400
32      7.500
33      8.500
34     15.000
Name: 0, dtype: object

In [49]:
m2_df

            0       1          2          3
0      460 m²  460 m²  20 estac.       None
1       50 m²   50 m²     1 rec.     1 baño
2      237 m²  237 m²   5 estac.       None
3      236 m²  236 m²   5 estac.       None
4       60 m²   60 m²     1 rec.     1 baño
5      237 m²  237 m²   5 estac.       None
6      140 m²  140 m²     1 baño   2 estac.
7      488 m²  200 m²   2 estac.       None
8       45 m²   45 m²     1 baño       None
9      487 m²  487 m²     1 baño  10 estac.
10    1000 m²   12 m²     1 rec.    2 baños
11          4  180 m2       None       None
12          1   84 m2       None       None
13          2  160 m2       None       None
14          4  200 m2       None       None
15          1  253 m2       None       None
16          1   60 m2       None       None
17          1   36 m2       None       None
18     237 m2    None       None       None
19     236 m2    None       None       None
20     414 m2    None       None       None
21     236 m2    None       None       None
22          1  344 m2       None       None
23     970 m2    None       None       None
24      55 m2    None       None       None
25      55 m2    None       None       None
26          2  120 m2       None       None
27          4  487 m2       None       None
28      50 m2    None       None       None
29      21 m2    None       None       None
30      50 m2    None       None       None
31  253.61 m2    None       None       None
32      32 m2    None       None       None
33          1   30 m2       None       None
34     200 m2    None       None       None

#Despues de eso, empezamos hacer la formula para poder sacar el m2 de un cada inmueble:
def metro_cuadrado():
    
    return

In [52]:
#primera formula: Se divide el m2 entre el precio:

#precio neto del metro cuadrado:
precio_m2 = 265.51

In [ ]:
#Variable que contiene los metros cuadrados:
m2_df 

#Variable que contieen precio:
precio

### #Analisis Financiero sobre los precios y m2 de cada inmueble:

In [55]:
#Comprobamos cual es el dato menor:
print("Precio minimo: ", price.min())

#Comprobamos cual es el dato maximo:
print("Precio maximo: ", price.max())

Precio minimo:  3.0
Precio maximo:  250.0